{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zepto-allows-you-to-buy-land-as-fast-as-groceries-check-details-house-of-abhinandan-lodha-hoabl-2774247-2025-08-20",
      "headline": "Now you can buy land via a mobile app in minutes. Here's howThe initiative is intended to make land purchases easier, quicker and more transparent by using a platform that millions already rely on for daily shopping."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-next-gen-gst-make-homes-more-affordable-gst-on-affordable-housing-2025-2774178-2025-08-20",
      "headline": "Will next-gen GST make homes more affordable?With the government considering a simpler two-slab GST structure, many are asking a key question: Will the new system finally make home buying more affordable?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rapido-fine-rs-10-lakh-false-misleading-ads-ccpa-refund-customers-2774174-2025-08-20",
      "headline": "Rapido fined Rs 10 lakh over false ads, regulator orders refunds to consumersThe penalty follows complaints that Rapido's ads such as \"Guaranteed Auto\" and \"Auto in 5 min or get Rs 50\" misled customers by creating the impression of guaranteed services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-213-points-higher-nifty-above-25000-infosys-up-4-percent-2774119-2025-08-20",
      "headline": "Sensex ends 213 points higher, Nifty above 25,000; Infosys up 4%The S&P BSE Sensex gained 213.45 points to close at 81,857.84, while the NSE Nifty50 added 69.90 points to end at 25,050.55. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ca-explains-the-risks-behind-no-emi-till-possession-schemes-2774105-2025-08-20",
      "headline": "CA explains the risks behind 'No EMI till possession' schemesMany homebuyers are lured by \"No EMI Till Possession\" schemes, but a chartered accountant warns that these offers can carry hidden financial risks that may leave buyers paying for a property they never receive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-refiners-resume-russian-oil-purchases-amid-trump-tariff-threats-news-agency-reuters-2774044-2025-08-20",
      "headline": "Indian-state run refiners resume Russian oil purchase amid tariff threats: ReportThe resumption of Russian oil imports by Indian state refiners could reduce supplies for top buyer China, which had stepped up purchases during their absence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/labubu-mania-is-back-as-pop-mart-shares-rise-by-11-percent-ceo-predicts-record-sales-2774005-2025-08-20",
      "headline": "Labubu mania is back as Pop Mart shares rise by 11%, CEO predicts record salesPop Mart reported a 204% rise in revenue to 13.88 billion yuan for the first half of 2025, beating the average analyst estimate of 13.76 billion yuan. Net income jumped 397% to 4.57 billion yuan, highlighting the company's rapid growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/online-betting-gaming-real-money-shares-down-nazara-technologies-delta-corp-2773965-2025-08-20",
      "headline": "Online gaming bill: Nazara Technologies and Delta Corp shares take a hitThe bill, which proposes strict rules for money-based online games and makes online betting a punishable offence, is expected to be tabled in the Lok Sabha later today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/shifted-to-new-tax-regime-here-are-5-investments-you-shouldnt-drop-nps-elss-2773943-2025-08-20",
      "headline": "Shifted to new tax regime? Here are 5 investments you shouldn't dropAlthough the new regime comes with lower tax rates and no exemptions, several traditional investment products continue to play a vital role in securing your finances and growing long-term wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-targets-private-refiners-ril-nayara-ioc-india-import-russia-oil-tariff-2773938-2025-08-20",
      "headline": "US targets Indian refiners, says richest families made excess profitsThe criticism from US is focused on India's private refiners, particularly Reliance Industries and Nayara Energy, which together account for a large share of refined fuel exports to Europe."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-shares-jump-13-as-winning-streak-continues-what-next-2773919-2025-08-20",
      "headline": "Ola Electric shares jump 13%, up over 20% in two sessions. Should you buy?On Tuesday, the stock climbed almost sharply after founder and chairman Bhavish Aggarwal outlined an aggressive strategy to reclaim market share and improve profitability in India's competitive EV segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-down-it-stocks-gain-banking-financials-decline-bajaj-finance-airtel-2773891-2025-08-20",
      "headline": "Sensex, Nifty open lower as financial stocks offset IT gains in early tradeThe S&P BSE Sensex was down by 125.67 points to 81,518.72, while the NSE Nifty50 lost 34.50 points to 24,946.15 as of 9:33 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/game-over-for-online-gaming-firms-industry-in-shock-over-proposed-blanket-ban-2773881-2025-08-20",
      "headline": "Game over for money-based online gaming? Industry in shock over proposed banIf passed in Parliament, the bill will outlaw all money-based online games (irrespective of whether they involve skill or chance), ban advertisements promoting such platforms, and bar banks and financial institutions from processing related transactions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/will-cause-serious-harm-all-india-gaming-federation-writes-to-amit-shah-on-online-gaming-ban-2773868-2025-08-20",
      "headline": "Death knell for industry: Gaming body writes to Amit Shah on money-based gaming banIn its communication, the All India Gaming Federation stressed the need for \"progressive regulation\" rather than outright prohibition, highlighting the potential fallout for millions of players and the broader industry."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-to-ban-all-money-based-gaming-transactions-under-online-gaming-bill-sources-2773674-2025-08-19",
      "headline": "Centre to ban all money-based gaming transactions under new bill: SourcesUnder the proposed Regulation & Promotion of Online Gaming Act, banks and financial institutions will not be allowed to process or transfer funds for real-money online games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-up-370-points-nifty-above-24950-adani-ports-tata-motors-among-top-gainers-2773517-2025-08-19",
      "headline": "Sensex, Nifty close higher on GST buzz, easing global tensionsThe S&P BSE Sensex gained 370.64 points, while the NSE Nifty50 rose 103.70 points to settle at 24,980.65. Broader markets also ended in the green, with mid- and small-cap stocks outperforming."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pm-viksit-bharat-rozgar-yojana-who-can-get-rs-15000-and-other-benefits-2773508-2025-08-19",
      "headline": "PM Viksit Bharat Rozgar Yojana: Who can get Rs 15,000 and other benefitsFirst-time employees under Part A can receive a one-time incentive equal to about one month's basic pay, up to Rs 15,000, paid in two instalments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/two-retirees-rs-2-crore-each-yet-one-runs-out-of-money-early-ca-explains-why-2773436-2025-08-19",
      "headline": "Two retirees, Rs 2 crore each, yet one runs out of money early. CA explains whyTwo retirees may have the same Rs 2 crore in savings, but their financial journeys can differ drastically. A CA explains how market timing and sequencing risk can decide who runs out of money first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-reform-overhaul-two-slab-structure-done-deal-or-not-2773431-2025-08-19",
      "headline": "Are next-gen GST reforms a done deal?The next-gen GST overhaul could redefine India's tax landscape, but consensus among states and revenue concerns will decide its fate. For now, GST 2.0 is a promise, not a done deal. Read to know why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-u-explained-check-eligibility-deadline-and-penalties-for-updated-returns-2773383-2025-08-19",
      "headline": "ITR-U explained: Check eligibility, deadline, and penalties for updated returnsThe Central Board of Direct Taxes (CBDT) has made it simpler for taxpayers to correct errors in their income tax returns through the updated ITR-U. Here's a guide on who can file, the deadline, and possible penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-you-should-wait-until-october-for-big-purchases-explains-expert-2773330-2025-08-19",
      "headline": "Why you should wait until October for big purchases, explains expertIf you've been planning to buy a car, air conditioner, or other expensive items, it might be wise to hold off for a few weeks. Expert says waiting until October could save you money thanks to upcoming GST reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lower-gst-better-than-income-tax-relief-for-your-wallet-savings-2773328-2025-08-19",
      "headline": "Why lower GST is better for your wallet than income tax reliefUnlike income tax, which applies only to those earning above a certain threshold, GST is an indirect tax levied on almost every transaction, covering nearly everything you buy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-semiconductor-complex-fire-1989-impact-and-indigenous-chip-production-plan-2773326-2025-08-19",
      "headline": "How the SCL fire in Mohali sabotaged India's chip dreamsThe blaze caused losses estimated at Rs 75 crore in 1989, but the true cost the nation would pay would be known decades later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-share-price-rising-today-explained-2773263-2025-08-19",
      "headline": "Explained: Why Ola Electric shares rose 7% in early tradeOla Electric's rising share price appears to be a result of renewed investor optimism, driven by the company's ambitious EV targets and gigafactory plans, but sustaining momentum will depend on market share recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-over-150-points-higher-nifty-above-24900-ril-jumps-nearly-2-2773238-2025-08-19",
      "headline": "Sensex, Nifty gain as GST reforms buzz keeps investor sentiment bullishAt 9:21 am, the S&P BSE Sensex climbed 150.78 points to 81,424.53, while the NSE Nifty50 gained 38.15 points to 24,915.10. Most broader market indices also traded in the green during early deals, indicating improved investor sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/next-generation-gst-reforms-will-reduce-tax-burden-boost-growth-chief-economic-advisor-2773229-2025-08-19",
      "headline": "Next-generation GST reforms will reduce tax burden, boost growth: CEAChief Economic Advisor Dr. V Anantha Nageshwaran said the GST overhaul, coupled with earlier tax cuts, will lower consumer costs, ease inflation, and boost disposable incomes, calling it a transformative step in India's eight-year tax reform journey"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/received-a-fake-income-tax-call-key-warning-signs-and-tips-to-protect-yourself-2772963-2025-08-18",
      "headline": "Received a fake income tax call? Key warning signs and tips to protect yourselfScammers are increasingly posing as income tax officials to trick people into sharing personal and financial information. If you receive a suspicious call during the filing season, it's important to stay calm and know the warning signs before taking any action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-job-unemployment-rate-drops-52-percent-july-festive-season-gst-cut-agriculture-economy-gdp-2772962-2025-08-18",
      "headline": "India's job market shows relief as unemployment rate falls to 5.2% in JulyThe jobless rate in rural areas for people aged 15 years and above fell to 4.4% in July from 4.9% in June. Seasonal demand for workers in agriculture and related activities supported this improvement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-bengaluru-new-office-rs-1000-crore-embassy-zenith-10-year-report-2772934-2025-08-18",
      "headline": "Apple rents 2.7 lakh sq ft in Bengaluru, costing Rs 1,000 crore over a decadeThe lease covers nine floors, from the 5th to the 13th floor, in the Embassy Zenith building. Apple has also made a security deposit of Rs 31.57 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-quicker-pf-access-here-are-the-updated-epfo-rules-2772871-2025-08-18",
      "headline": "Want quicker PF access? Here are the updated EPFO rulesUnder the updated rules, if your name, gender and date of birth match in both Aadhaar and UAN records, you no longer need EPFO approval to link the two."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-676-points-higher-nifty-above-24800-maruti-gains-9-percent-2772869-2025-08-18",
      "headline": "Sensex ends 676 points higher, Nifty above 24,800; Maruti gains 9%The S&P BSE Sensex gained 676.09 points to end at 81,273.75, while the NSE Nifty50 added 245.65 points to close at 24,876.95.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-tax-cut-festive-season-diwali-save-money-common-man-shopkeepers-cheaper-items-food-appliance-prices-2772865-2025-08-18",
      "headline": "GST bonanza before festive rush? Here's what it could mean for youThe biggest change for middle-class families could be in aspirational goods such as televisions, refrigerators, and washing machines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/crorepati-on-paper-cash-poor-in-reality-ca-explains-why-liquidity-matters-more-than-net-worth-2772767-2025-08-18",
      "headline": "Crorepati on paper, cash-poor in reality? CA explains why liquidity matters moreA high net worth can be misleading if most of your wealth is tied up in property or long-term investments. An expert believes that true financial security comes from having liquid assets that can be accessed at short notice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-cut-tax-slabs-low-reforms-rationalisation-insurance-everyday-item-cars-appliance-tv-money-2772777-2025-08-18",
      "headline": "GST cut before Diwali? These items likely to cost you less this festive seasonPrime Minister Narendra Modi gave the first indication of GST reforms in his Independence Day address from the Red Fort, calling it a \"Diwali Bonanza.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/sunjay-kapurs-sister-raises-concern-over-treatment-of-family-claims-being-sidelined-2772711-2025-08-18",
      "headline": "Exclusive: Sunjay Kapur's sister raises concern over treatment of familyMandhira Kapur Smith, sister of late Sona Comstar Chairperson Sunjay Kapur, has raised concerns over her family's treatment by the automotive firm founded by their late father. She said her 80-year-old mother Rani Kapur has been sidelined, claiming the family has been treated \"like strangers\" and excluded from obituaries and public acknowledgments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/big-gst-cuts-ahead-will-small-cars-insurance-get-cheaper-2772687-2025-08-18",
      "headline": "Big GST cuts ahead: Will small cars, insurance get cheaper?The proposal to reduce GST on insurance premiums could make health and life cover more affordable. Industry experts say this would be a welcome change and could help improve insurance penetration across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-6-excel-utility-now-live-who-is-eligible-to-file-2772650-2025-08-18",
      "headline": "ITR-6 excel utility now live: Who is eligible to file?The Income Tax Department has rolled out the excel utility for ITR-6 for AY 2025-26. But this form isn't meant for everyone — here's who is required to use it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/regaal-resources-ipo-allotment-out-today-status-online-guide-gmp-listing-gains-stock-market-debut-date-2772642-2025-08-18",
      "headline": "Regaal Resources IPO allotment today: Check status, GMP & listing dateInvestors who applied for the IPO can check their allotment status either through the BSE website or the registrar's platform, MUFG Intime India Private Limited (previously known as Link Intime India Pvt Ltd)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-up-1000-points-nifty-jump-stock-market-rally-auto-maruti-suzuki-mahindra-tata-motors-bajaj-gst-reform-diwali-2772619-2025-08-18",
      "headline": "Maruti Suzuki rallies 8%: Why GST relief is driving auto stocks higherEarly trade clearly showed strong buying in auto and financial stocks, while IT and pharma names dragged at the bottom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-sensex-jumps-1000-points-simpler-gst-regime-credit-rating-boost-2772615-2025-08-18",
      "headline": "Sensex jumps 1,000 points: Why is stock market rising today?At 9:24 am, the S&P BSE Sensex was up 950.18 points at 81,547.84, while the NSE Nifty50 jumped 310 points to 24,941.90. Broader market indices also gained as investors cheered the prospects of a simplified GST regime and an upgrade in India's sovereign credit rating by S&P."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/srk-gauri-step-aside-aryan-takes-center-stage-bads-of-bollywood-event-netflix-2774338-2025-08-20",
      "headline": "SRK, Gauri step aside as Aryan takes center stage at Bads of Bollywood eventActor Shah Rukh Khan and his producer wife Gauri Khan joined their son Aryan at the preview launch event for 'The Bads of Bollywood'. The upcoming Netflix show marks Aryan's directorial debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kjo-ananya-panday-praise-aryan-bads-of-bollywood-preview-absolute-blockbuster-2774321-2025-08-20",
      "headline": "KJo, Ananya Panday praise Aryan's Bads of Bollywood preview: Absolute blockbusterKaran Johar, Ananya Panday and other Bollywood celebrities reacted to Aryan Khan's Bads of Bollywood preview. Karan and Ananya congratulated Aryan on his directorial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/samantha-ruth-prabhu-opens-up-on-social-media-pressure-and-negativity-online-2774210-2025-08-20",
      "headline": "Samantha opens up on social media pressure and online negativitySamantha Ruth Prabhu shared that while social media bring both praise and trolling, she manages it by staying authentic and taking breaks. The actor also credited the platform for helping her find mentors who positively influenced her life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bobby-deol-recalls-friendship-with-shah-rukh-khan-aryan-khan-is-all-set-to-conquer-the-world-2774305-2025-08-20",
      "headline": "Bobby Deol recalls friendship with SRK, says Aryan is all set to conquer the worldBobby Deol spoke about his 30-year-old friendship with Shah Rukh Khan at the 'Bads of Bollywood' preview event. The series will premiere on September 18 on Netflix. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywood-aryan-khan-bows-down-seeks-forgiveness-for-future-mistakes-2774301-2025-08-20",
      "headline": "The Bads of Bollywood: Aryan Khan bows down, seeks forgiveness for future mistakesAryan Khan, who has made his directorial debut with 'The Bads of Bollywood', bowed down to the audience and asked for their forgiveness in advance at the launch of the Netflix show. He said he has made the show with love but if anything goes wrong, he is already apologising. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nandamuri-balakrishna-in-tears-at-sister-in-law-padmaja-funeral-video-goes-viral-2774259-2025-08-20",
      "headline": "Nandamuri Balakrishna in tears at sister-in-law Padmaja's funeral, video goes viralNandamuri Padmaja, wife of Nandamuri Jayakrishna, died on August 19 in Hyderabad, leaving the Nandamuri family and fans in grief. A video of Balakrishna breaking down while meeting mourners has gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-tejas-mass-jathara-postponed-producer-naga-vamsi-addresses-online-rumours-2774187-2025-08-20",
      "headline": "Ravi Teja's Mass Jathara postponed, producer Naga Vamsi addresses online rumours Ravi Teja's upcoming commercial entertainer 'Mass Jathara', initially scheduled for release on August 27, has been postponed. Producer Naga Vamsi confirmed the delay through a cryptic post on social media.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-social-media-bads-of-bollywood-preview-lakshya-sahher-bambba-salman-khan-karan-johar-ranveer-singh-2774262-2025-08-20",
      "headline": "Aryan Khan just went full throttle: Internet praises The Bads of Bollywood previewAryan Khan's directorial debut, 'The Bads of Bollywood', has garnered positive social media feedback. The series promises a fresh take on Bollywood featuring Lakshya and Sahher Bambba. It also has cameo appearances by Salman Khan, Karan Johar and Ranveer Singh, among others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/meet-the-cast-of-the-bads-of-bollywood-2774293-2025-08-20",
      "headline": "Meet the cast of The Bads of BollywoodAryan Khan's directorial debut, 'The Bads of Bollywood', had its preview launch on August 20. The show has an impressive star cast that promises drama and entertainment. Here's a look at the main cast and their roles:\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/srk-witty-take-on-injury-bads-of-event-one-hand-enough-for-national-award-2772555-2025-08-20",
      "headline": "One hand enough for National Award: SRK witty take on injuryActor Shah Rukh Khan spoke about his injury at Bads of Bollywood preview launch event. He praised the Aryan Khan's directorial and the team for their dedication towards the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywood-preview-salman-khan-ranveer-singh-and-blurry-showbiz-lines-in-aryan-khan-the-bads-of-bollywood-preview-2774275-2025-08-20",
      "headline": "Salman, Ranveer and blurry showbiz lines in Aryan's The Bads of Bollywood preview'The Bads of Bollywood' preview features Salman Khan and Ranveer Singh mirroring the Hindi film industry. The show is directed and written by Aryan Khan, son of superstar Shah Rukh Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mamata-banerjee-fears-skeletons-may-tumble-out-with-the-bengal-files-vivek-agnihotri-2774189-2025-08-20",
      "headline": "Mamata Banerjee fears skeletons may tumble out with The Bengal Files: Vivek AgnihotriFrom Direct Action Day to the Noakhali riots, 'The Bengal Files' claims to show Bengal's turbulent past. In an exclusive interview, director Vivek Agnihotri said the Mamata Banerjee-led TMC fears the film's truth, calling the trailer launch cancellation a misuse of state power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/revisiting-bigg-boss-top-controversies-ex-vs-present-to-fights-what-to-expect-next-2774046-2025-08-20",
      "headline": "7 most explosive Bigg Boss controversies, and will Season 19 top it?Ahead of the Bigg Boss 19 premiere on August 24, here is a look at the top controversies surrounding Salman Khan's show. From Isha Malviya's ex, Abhishek Kumar, slapping her then-boyfriend Samarth Jurel to Kashish Kapoor accusing Avinash Mishra of being a womaniser, the show has seen it all."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-kundrra-dating-app-screenshot-relationship-tejasswi-prakash-2774147-2025-08-20",
      "headline": "Karan Kundrra laughs off viral dating profile: Happens every 6 monthsA screenshot of the actor Karan Kundrra's profile on Bumble has gone viral. The actor, who is in a relationship with actor Tejasswi Prakash, dismissed the rumour of being on the dating app in a recent interview. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/summer-i-turned-pretty-season-3-episode-7-update-story-cast-details-report-belly-conrad-and-the-confession-that-wrecked-us-all-2774141-2025-08-20",
      "headline": "Summer I Turned Pretty: Belly, Conrad and the confession that wrecked us all'The Summer I Turned Pretty' Season 3, Episode 7, delivers ultimate heartbreak as Belly questions Jeremiah, relives Conrad's flashbacks, and faces the most emotional confession of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anil-kapoor-shares-sweet-birthday-wish-for-grandson-vayu-as-he-turns-3-2774126-2025-08-20",
      "headline": "Anil Kapoor shares sweet birthday wish for grandson Vayu as he turns 3. PicsSonam Kapoor and Anand Ahuja's son, Vayu, turned three today and received a heartwarming birthday wish from his grandfather, Anil Kapoor. Sharing precious family moments, Anil wrote an emotional note celebrating the joy Vayu has brought into their lives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/host-ashneer-grover-rejects-5-contestants-on-rise-fall-for-being-too-boring-2774138-2025-08-20",
      "headline": "Host Ashneer Grover rejects 5 contestants on Rise & Fall for being boring: Source'Rise & Fall' host Ashneer Grover took charge of the show's casting and rejected five contestants, citing them boring. The show will premiere on MX Player. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/after-coolie-nagarjuna-teams-up-with-tamil-director-ra-karthik-for-100th-film-2773996-2025-08-20",
      "headline": "After Coolie, Nagarjuna teams up with Tamil director Ra Karthik for 100th filmNagarjuna, who recently impressed audiences as Simon in Rajinikanth's 'Coolie', has now revealed details of his milestone 100th film, tentatively titled 'King 100'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-mania-rages-mumbai-streets-fans-perform-his-hit-tracks-war-2-2774116-2025-08-20",
      "headline": "Hrithik Roshan mania rages on Mumbai streets as fans perform his hit tracks. WatchHrithik Roshan flocked to the Mumbai streets and performed on the actor's hit tracks amid the 'War 2' release. The video from the celebration has emerged online. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amit-shah-venugopal-in-fiery-lok-sabha-face-off-pm-cm-removal-bill-lok-sabha-2774175-2025-08-20",
      "headline": "You'll teach me morality? Amit Shah vs KC Venugopal in fiery Lok Sabha face-offThe Lok Sabha witnessed high drama on Wednesday as Union Home Minister Amit Shah and Congress MP KC Venugopal sparred over \"morality\" during a stormy debate on three controversial bills."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/unjustified-untenable-government-junks-nepals-remarks-on-india-china-trade-resumption-through-lipulekh-pass-2774359-2025-08-20",
      "headline": "Untenable: Government slams Nepal's remarks on India-China trade through LipulekhIndia condemned Nepal's opposition to the resumption of India-China trade through the Lipulekh Pass, calling Kathmandu's territorial claims over the Kalapani region unjustified and historically unfounded. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/going-back-to-medieval-times-when-king-sack-anybody-at-his-will-rahul-gandhi-on-bills-to-remove-ministers-2774255-2025-08-20",
      "headline": "Back to medieval times: Rahul Gandhi, in black T-shirt, slams new billsAmit Shah introduced three bills in the Lok Sabha under which the Prime Minister and chief ministers of states and union territories could be removed if they have been arrested for 30 consecutive days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rekha-gupta-attacked-jan-sunwai-programme-accused-arrested-reaction-2774312-2025-08-20",
      "headline": "Can't break my spirit: Rekha Gupta's first reaction on attack during public meetDelhi Chief Minister Rekha Gupta said the attack on her during a public outreach programme was a \"cowardly attempt\" on her resolve to serve the people. She also said she was in shock, but was feeling better."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/google-pixel-10-phones-launched-in-india-from-vanilla-10-to-pro-and-fold-take-your-pick-2774332-2025-08-20",
      "headline": "Google Pixel 10 phones launched in India, from vanilla 10 to Pro and FoldGoogle's new Pixel 10 phones are here. In total there are four phones — Pixel 10, Pixel 10 Pro, Pixel 10 Pro XL and the Pixel 10 Pro Fold. They bring to users a new suite of AI features, a more powerful Tensor G5 chipset and plenty of camera updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-rejects-bangaldeshs-claim-of-awami-league-activities-in-india-sheikh-hasina-2774319-2025-08-20",
      "headline": "Misplaced statement: Government junks Bangladesh's Awami activities in India claimIndia firmly rejected Bangladesh's allegations of anti-Bangladesh activities being carried out from its soil by Sheikh Hasina's Awami League members, calling the claims 'misplaced'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-jain-community-convince-bmc-for-slaughterhouse-ban-during-paryushan-parva-2774205-2025-08-20",
      "headline": "Convincing Akbar was easier: Jains slam Mumbai civic body over slaughterhouse banThe BMC on August 14 ordered a two-day ban on slaughterhouses during the festival as demanded by the community, which sought that the ban be extended to seven days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/shrinking-gst-slabs-could-drive-consumption-but-itll-take-a-while-2774139-2025-08-20",
      "headline": "Shrinking GST slabs could drive consumption, but it'll take a whileThe biggest beneficiaries will be commoners, with GST reduced on all essential items, and SMEs, which will turn more competitive due to lower running costs"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywood-preview-salman-khan-ranveer-singh-and-blurry-showbiz-lines-in-aryan-khan-the-bads-of-bollywood-preview-2774275-2025-08-20",
      "headline": "Salman, Ranveer and blurry showbiz lines in Aryan's The Bads of Bollywood preview'The Bads of Bollywood' preview features Salman Khan and Ranveer Singh mirroring the Hindi film industry. The show is directed and written by Aryan Khan, son of superstar Shah Rukh Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/rahul-gandhi-approaches-top-court-over-vote-chori-in-bengaluru-lok-sabha-seat-2774390-2025-08-21",
      "headline": "Rahul Gandhi approaches top court over 'vote chori' in Bengaluru Lok Sabha seatRahul Gandhi has approached the Supreme Court, urging an investigation into alleged irregularities and manipulation in the voter list of the Bengaluru Central constituency during the 2024 Lok Sabha elections, by a Special Investigation Team (SIT) headed by a retired judge."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sack-arrested-cm-government-exception-law-amit-shah-monsoon-session-article-356-president-rule-ed-cbi-arvind-kejriwal-2774096-2025-08-20",
      "headline": "Why govt's turning an exception into law has critics alarmedIn 79 years of Independent India's history, only one chief minister went to jail and ran a government from there. Now, the Centre is bringing in a law that seems to address this exception. The law could become Article 356 through the backdoor, and used to force CMs to toe the line or sack elected governments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/russia-diplomat-roman-babushkin-us-trump-sanctions-india-tariffs-oil-trade-2774223-2025-08-20",
      "headline": "Our markets open for India: Russian diplomat's reality check to Trump on tiesRussian diplomat Roman Babushkin, in a press briefing, laid out the red carpet for India to export its products to Russia amid punitive US tariffs while castigating Trump for humiliating its 'friends'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/google-pixel-watch-4-arrives-in-india-more-affordable-pixel-buds-2a-also-launched-2774341-2025-08-20",
      "headline": "Google Pixel Watch 4 and more affordable Pixel Buds 2a launched in IndiaAlong with the Pixel 10 phones, Google on Wednesday night also launched the Pixel Watch 4 and the Pixel Buds 2a in India. The two devices will be available for sale in the coming days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/akshay-kumar-and-arshad-warsi-summoned-by-pune-court-over-portrayal-of-lawyers-judges-in-jolly-llb-3-teaser-2774346-2025-08-20",
      "headline": "Akshay Kumar, Arshad Warsi summoned by court for lawyers' portrayal in Jolly LLB 3Advocates Wajed Khan (Bidkar) and Ganesh Mhaskhe filed a petition alleging that the film's teaser portrays lawyers and judges in a disrespectful manner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bilateral-trade-jumps-five-times-imbalance-widening-jaishankar-moscow-glbs-2774385-2025-08-21",
      "headline": "Bilateral trade jumps five times, but imbalance widening, says Jaishankar in MoscowAt the session co-chaired with Russia's First Deputy Prime Minister Denis Manturov, Jaishankar said the India-EAEU FTA, long in discussion, must be finalised without delay."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/will-break-table-tear-bill-chaos-likely-in-parliament-over-motion-to-remove-arrested-pm-chief-ministers-2773915-2025-08-20",
      "headline": "Opposition tears bills to remove arrested ministers, throws it at Amit ShahUnder the proposed legislation, a PM, Chief Minister or minister facing serious charges will lose their chair if they are arrested for 30 consecutive days. The three bills were later sent to a joint panel for scrutiny."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywood-aryan-khan-bows-down-seeks-forgiveness-for-future-mistakes-2774301-2025-08-20",
      "headline": "The Bads of Bollywood: Aryan Khan bows down, seeks forgiveness for future mistakesAryan Khan, who has made his directorial debut with 'The Bads of Bollywood', bowed down to the audience and asked for their forgiveness in advance at the launch of the Netflix show. He said he has made the show with love but if anything goes wrong, he is already apologising. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/archana-tiwari-lawyer-civil-judge-aspirant-disappearance-police-case-found-marriage-nepal-2774183-2025-08-20",
      "headline": "Inside Archana Tiwari missing case: Marriage pressure, trip to Nepal and police netArchana Tiwari, a 22-year-old lawyer and civil judge aspirant, staged her own disappearance to escape family pressure to abandon her studies and marry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sara-tendulkar-exclusive-australia-memories-cricket-career-2774348-2025-08-20",
      "headline": "Sara Tendulkar recalls Australia memories, reveals why she never pursued cricketSpeaking exclusively to India Today, Sara Tendulkar opened up about her childhood memories of Australia and her decision not to pursue cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-narendra-modi-govt-drew-the-line-with-online-gaming-bill-2774152-2025-08-20",
      "headline": "Why Modi govt drew the line with online gaming billBehind the swift push to the Promotion and Regulation of Online Gaming Bill is the Sangh Parivar's ideological pressure and the Modi government's view that profits cannot come at the cost of social order"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mumbai-rain-spider-man-web-mop-wiper-battles-flooded-streets-in-viral-video-2774261-2025-08-20",
      "headline": "Mumbai's 'Spider-Man' swaps web for mop, battles flooded streets in viral videoIn the clip, Mumbai's 'Spider-Man' can be seen wiping away the excess rainwater left on the roads with the help of a wiper. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-test-fires-agni-5-intermediate-range-ballistic-missile-in-odishas-chandipur-2774298-2025-08-20",
      "headline": "India test-fires Agni-5 intermediate-range ballistic missile in major defence boostIndia on Wednesday successfully test-fired its Agni-5 ballistic missile off the Odisha coast, validating all operational parameters in a major boost to its strategic defence capabilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/icssr-warns-csds-sanjay-kumar-deleted-post-voter-data-maharashtra-controversy-vote-chori-rahul-gandhi-2774120-2025-08-20",
      "headline": "Funder warns CSDS as ghost of deleted post haunts it amid vote-theft rowThe ICSSR, which funds think-tank CSDS, has sought answers from it after co-director Sanjay Kumar deleted a post claiming irregularities in voter numbers in two seats of Maharashtra. The now-deleted post, flagging abnormal voter spikes between Lok Sabha and Assembly polls in Maharashtra, was used by the Congress to allege vote-theft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rapido-fine-rs-10-lakh-false-misleading-ads-ccpa-refund-customers-2774174-2025-08-20",
      "headline": "Rapido fined Rs 10 lakh over false ads, regulator orders refunds to consumersThe penalty follows complaints that Rapido's ads such as \"Guaranteed Auto\" and \"Auto in 5 min or get Rs 50\" misled customers by creating the impression of guaranteed services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/srk-gauri-step-aside-aryan-takes-center-stage-bads-of-bollywood-event-netflix-2774338-2025-08-20",
      "headline": "SRK, Gauri step aside as Aryan takes center stage at Bads of Bollywood eventActor Shah Rukh Khan and his producer wife Gauri Khan joined their son Aryan at the preview launch event for 'The Bads of Bollywood'. The upcoming Netflix show marks Aryan's directorial debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kjo-ananya-panday-praise-aryan-bads-of-bollywood-preview-absolute-blockbuster-2774321-2025-08-20",
      "headline": "KJo, Ananya Panday praise Aryan's Bads of Bollywood preview: Absolute blockbusterKaran Johar, Ananya Panday and other Bollywood celebrities reacted to Aryan Khan's Bads of Bollywood preview. Karan and Ananya congratulated Aryan on his directorial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/samantha-ruth-prabhu-opens-up-on-social-media-pressure-and-negativity-online-2774210-2025-08-20",
      "headline": "Samantha opens up on social media pressure and online negativitySamantha Ruth Prabhu shared that while social media bring both praise and trolling, she manages it by staying authentic and taking breaks. The actor also credited the platform for helping her find mentors who positively influenced her life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nandamuri-balakrishna-in-tears-at-sister-in-law-padmaja-funeral-video-goes-viral-2774259-2025-08-20",
      "headline": "Nandamuri Balakrishna in tears at sister-in-law Padmaja's funeral, video goes viralNandamuri Padmaja, wife of Nandamuri Jayakrishna, died on August 19 in Hyderabad, leaving the Nandamuri family and fans in grief. A video of Balakrishna breaking down while meeting mourners has gone viral."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-aditya-thackeray-bcci-india-vs-pakistan-letter-sports-minister-2774384-2025-08-21",
      "headline": "BCCI above national interest? Aditya Thackeray on IND vs PAK at Asia CupAaditya Thackeray slammed the BCCI for prioritising revenue over national interest by sending India to play Pakistan in the Asia Cup, questioning whether cricketing ties should continue despite terror attacks and ongoing political tensions between the neighbours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/venkatesh-prasad-ksca-election-bid-chinnaswamy-promise-manifesto-2774370-2025-08-20",
      "headline": "Bring glory back to Chinnaswamy: Venkatesh Prasad promises in KSCA election bidVenkatesh Prasad has pledged to restore Chinnaswamy Stadium's lost glory, promising better safety, more international matches, and smart infrastructure as he enters the KSCA election race with a reform-driven vision for Karnataka cricket's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sara-tendulkar-exclusive-australia-memories-cricket-career-2774348-2025-08-20",
      "headline": "Sara Tendulkar recalls Australia memories, reveals why she never pursued cricketSpeaking exclusively to India Today, Sara Tendulkar opened up about her childhood memories of Australia and her decision not to pursue cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ufc-islam-makhachev-vs-jack-della-maddalena-2774345-2025-08-20",
      "headline": "Jack Della Maddalena vs Islam Makhachev: The clash that has UFC fans and fighters talkingIslam Makhachev is moving up to welterweight to challenge Jack Della Maddalena in a high-stakes UFC superfight. Will Makhachev's elite grappling overcome Della Maddalena's knockout power, or will the Aussie striker stop the lightweight king's quest for double-champ glory?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sports-authority-of-india-under-funded-khelo-india-scheme-india-olympics-results-2774342-2025-08-20",
      "headline": "Parliamentary panel calls SAI under-funded, slams India's poor Olympic showA parliamentary panel has slammed low funding and staff shortages at SAI while raising red flags over underutilisation and diversion of funds in the Khelo India scheme, calling India's international sporting performance \"far from satisfactory.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/durand-cup-east-bengal-vs-diamond-harbour-fc-dream-run-end-defeat-2774334-2025-08-20",
      "headline": "Durand Cup: Diamond Harbour stun East Bengal, end dream run in semi-finalEast Bengal's fairy-tale Durand Cup campaign ended in heartbreak as debutants Diamond Harbour FC scripted a stunning 2-1 semi-final upset, with former East Bengal men Mirshad Michu and Joby Justin playing pivotal roles in the shocker."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-olympics-2036-host-australia-offer-expertise-2774330-2025-08-20",
      "headline": "Australia ready to offer expertise as India aims to host Olympics in 2036Australia has offered support to India's pursuit of hosting the 2036 Olympics, with High Commissioner Philip Green highlighting the potential for a strong partnership as both nations aim to strengthen their role in global sports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-exclusion-asia-cup-kris-srikkanth-slams-agarkar-2774311-2025-08-20",
      "headline": "Nonsense: Kris Srikkanth blasts Ajit Agarkar over Iyer's Asia Cup snub reasoningFormer India captain Kris Srikkanth has criticised selection committee chief Ajit Agarkar over Shreyas Iyer's omission from the Asia Cup squad. Iyer was among the notable omissions in the 15-man squad, led by Suryakumar Yadav. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vinod-kambli-struggling-to-speak-brother-health-update-2774302-2025-08-20",
      "headline": "Vinod Kambli still struggling to speak: Brother shares health updateVinod Kambli's health continues to be a concern as his brother revealed that the former India cricketer still struggles to speak properly while recovering at home, months after being hospitalised for brain clots and urinary infection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-hockey-2025-schedule-announced-rajgir-host-without-pakistan-oman-2774204-2025-08-20",
      "headline": "Asia Cup hockey to go on without Pakistan, Rajgir tournament schedule confirmedThe 12th Asia Cup Hockey will be held in Rajgir, Bihar from August 29 to September 7. Pakistan withdrew from the tournament, citing security concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/asia-cup-hockey-india-squad-announcement-harmanpreet-singh-bihar-2774190-2025-08-20",
      "headline": "India announce 18-member Men's Hockey squad for Asia Cup 2025 in BiharHockey India announced its 18-member Men's Asia Cup squad, led by Harmanpreet Singh. The team combines experience and balance across all positions, aiming to qualify for the 2026 FIH World Cup in Belgium-Netherlands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-olympics-2036-host-australia-offer-expertise-2774330-2025-08-20",
      "headline": "Australia ready to offer expertise as India aims to host Olympics in 2036Australia has offered support to India's pursuit of hosting the 2036 Olympics, with High Commissioner Philip Green highlighting the potential for a strong partnership as both nations aim to strengthen their role in global sports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-exclusion-asia-cup-kris-srikkanth-slams-agarkar-2774311-2025-08-20",
      "headline": "Nonsense: Kris Srikkanth blasts Ajit Agarkar over Iyer's Asia Cup snub reasoningFormer India captain Kris Srikkanth has criticised selection committee chief Ajit Agarkar over Shreyas Iyer's omission from the Asia Cup squad. Iyer was among the notable omissions in the 15-man squad, led by Suryakumar Yadav. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vinod-kambli-struggling-to-speak-brother-health-update-2774302-2025-08-20",
      "headline": "Vinod Kambli still struggling to speak: Brother shares health updateVinod Kambli's health continues to be a concern as his brother revealed that the former India cricketer still struggles to speak properly while recovering at home, months after being hospitalised for brain clots and urinary infection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-hockey-2025-schedule-announced-rajgir-host-without-pakistan-oman-2774204-2025-08-20",
      "headline": "Asia Cup hockey to go on without Pakistan, Rajgir tournament schedule confirmedThe 12th Asia Cup Hockey will be held in Rajgir, Bihar from August 29 to September 7. Pakistan withdrew from the tournament, citing security concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/asia-cup-hockey-india-squad-announcement-harmanpreet-singh-bihar-2774190-2025-08-20",
      "headline": "India announce 18-member Men's Hockey squad for Asia Cup 2025 in BiharHockey India announced its 18-member Men's Asia Cup squad, led by Harmanpreet Singh. The team combines experience and balance across all positions, aiming to qualify for the 2026 FIH World Cup in Belgium-Netherlands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/stuart-broad-coaching-roles-south-africa-consulting-stint-2774188-2025-08-20",
      "headline": "After consulting stint for South Africa, Stuart Broad eyes coaching roleStuart Broad is eyeing a coaching role by 2026, hoping to unearth England's next fast-bowling superstar. He also wants to sharpen his broadcasting skills, drawing inspiration from legends like Ricky Ponting and Ravi Shastri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-diamond-league-brussels-leg-skip-final-zurich-qualification-2774172-2025-08-20",
      "headline": "Neeraj Chopra skips Brussels leg after Diamond League final qualificationNeeraj Chopra has qualified for the Diamond League Final in Zurich and will skip the Brussels leg, focusing instead on reclaiming the Diamond Trophy before defending his world title at the Championships in Tokyo next month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shreyas-iyer-snub-bcci-selector-baffled-2774164-2025-08-20",
      "headline": "Shreyas Iyer's Asia Cup 2025 snub leaves former Indian selector baffledFormer selector Salil Ankola expressed disappointment over Shreyas Iyer's exclusion from the Asia Cup squad. The current chief selector Ajit Agarkar said it wasn't Iyer's fault but explained there was no place for him. Ankola, however, is surprised he wasn't even named in the reserves list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-shreyas-iyer-snub-robin-uthappa-surprise-t20-world-cup-deserving-2774151-2025-08-20",
      "headline": "Shreyas Iyer deserves T20 World Cup spot: Robin Uthappa after Asia Cup snubRobin Uthappa has backed Shreyas Iyer for a T20 World Cup 2026 return after his surprise exclusion from India's Asia Cup squad, calling the omission strange despite Iyer's IPL success and consistent domestic form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/golf/story/india-golf-league-igpl-women-olympics-la-2774056-2025-08-20",
      "headline": "What is IGPL? League that is set to swing a new era for Indian golfThe Indian Golf Premier League is set to change the landscape of the sport in the country. Amateurs and professionals will compete together, giving young talent a stage, bringing excitement to fans, and making the sport visible and inspiring in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/clutch-chess-exhibition-viswanathan-anand-gukesh-magnus-carlsen-reunion-2774118-2025-08-20",
      "headline": "Vishwanathan Anand-Kasparov reunion, Gukesh vs Carlsen clash confirmedViswanathan Anand will renew his rivalry with Garry Kasparov in St Louis this October, while world champion D Gukesh takes on Magnus Carlsen in the Clutch Chess exhibition. With USD 412,000 at stake, it's set to be one of the year's biggest events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-as-shubman-gill-ascends-as-the-next-big-star-sanju-samsons-t20i-dream-slips-away-2774083-2025-08-20",
      "headline": "Does Shubman Gill's return come at the cost of Sanju Samson's T20I career?Sanju Samson will likely become the sacrificial lamb as selectors bring back Shubman Gill into the T20I fold. With Gill rising as India's next all-format star, Samson's chances of establishing his legacy in T20 internationals look slimmer despite his explosive recent form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ashvir-singh-johal-first-sikh-youngest-manager-morecambe-fc-british-football-2774076-2025-08-20",
      "headline": "Who is Ashvir Singh Johal? The first Sikh and youngest manager in English footballAshvir Singh Johal has made history as the first Sikh to manage a professional British football club following his appointment at Morecambe. At 30, he also became the youngest manager across the top five tiers of English football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/golf/story/india-golf-league-igpl-women-olympics-la-2774056-2025-08-20",
      "headline": "What is IGPL? League that is set to swing a new era for Indian golfThe Indian Golf Premier League is set to change the landscape of the sport in the country. Amateurs and professionals will compete together, giving young talent a stage, bringing excitement to fans, and making the sport visible and inspiring in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/clutch-chess-exhibition-viswanathan-anand-gukesh-magnus-carlsen-reunion-2774118-2025-08-20",
      "headline": "Vishwanathan Anand-Kasparov reunion, Gukesh vs Carlsen clash confirmedViswanathan Anand will renew his rivalry with Garry Kasparov in St Louis this October, while world champion D Gukesh takes on Magnus Carlsen in the Clutch Chess exhibition. With USD 412,000 at stake, it's set to be one of the year's biggest events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-as-shubman-gill-ascends-as-the-next-big-star-sanju-samsons-t20i-dream-slips-away-2774083-2025-08-20",
      "headline": "Does Shubman Gill's return come at the cost of Sanju Samson's T20I career?Sanju Samson will likely become the sacrificial lamb as selectors bring back Shubman Gill into the T20I fold. With Gill rising as India's next all-format star, Samson's chances of establishing his legacy in T20 internationals look slimmer despite his explosive recent form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ashvir-singh-johal-first-sikh-youngest-manager-morecambe-fc-british-football-2774076-2025-08-20",
      "headline": "Who is Ashvir Singh Johal? The first Sikh and youngest manager in English footballAshvir Singh Johal has made history as the first Sikh to manage a professional British football club following his appointment at Morecambe. At 30, he also became the youngest manager across the top five tiers of English football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-icc-odi-rankings-disappear-2774065-2025-08-20",
      "headline": "ICC admits technical glitch after Kohli, Rohit vanish from ODI rankingsRohit Sharma and Virat Kohli disappeared from the ICC ODI rankings. The development comes only a week after they were placed at the 2nd and 4th spot. The disappearance is likely a glitch in the ICC system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-d-gukesh-abdusattorov-praggnanandhaa-sinquefield-cup-2774008-2025-08-20",
      "headline": "Sinquefield Cup: D Gukesh bounces back with superb win over AbdusattorovSinquefield Cup: D Gukesh bounced back from his opening-round setback with a fine win over former world rapid champion Nodirbek Abdusattorov of Uzbekistan in the second round. Meanwhile, R Praggnanandhaa drew quietly with Fabiano Caruana of the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-monday-night-raw-naomi-pregnancy-2773960-2025-08-20",
      "headline": "From Shock to Celebration: Fans React to Naomi's Emotional RAW MomentWWE's Naomi shocked fans on Monday Night RAW with a heartfelt pregnancy reveal. The WWE Universe, Reddit fans, and superstars like Becky Lynch, Bayley, Rhea Ripley, and Triple H reacted with joy, support, and emotion to this unforgettable real-life moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/bgms-season-4-iqoo-orangutan-leads-leaderboard-masters-challenger-series-2773940-2025-08-20",
      "headline": "WIP: BGMS S4 League Stage – Week 1, Day 2 ends with iQOO OG on topBGMS Season 4 features fierce competition, with iQOO Orangutan currently leading the Masters Series. The tournament's multi-series format keeps teams constantly striving for semifinal and playoff spots amid intense daily matchups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-mixed-doubles-emma-raducanu-carlos-alcaraz-2773944-2025-08-20",
      "headline": "Emma Raducanu and Carlos Alcaraz bow out early of the US Open 2025Emma Raducanu and Carlos Alcaraz were knocked out early from the 2025 US Open mixed doubles. Apart from the duo, there were multiple other high-profile players who bowed out early from the mixed doubles competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/shreyas-iyer-asia-cup-2025-exclusion-questioned-abhishek-nayar-2773927-2025-08-20",
      "headline": "Shreyas Iyer is not liked as much as someone else: Ex-coach questions Asia Cup snubFormer India assistant coach Abhishek Nayar has questioned Shreyas Iyer's exclusion from the Asia Cup 2025 squad. Shubman Gill, meanwhile, has been named vice-captain of the 15-man India team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-penalty-real-madrid-vs-osasuna-laliga-2773916-2025-08-20",
      "headline": "Madrid off to underwhelming start as Mbappe penalty earns 1-0 win over OsasunaReal Madrid were off to a stuttering start against Osasuna in their LaLiga opener. The last year's runner-ups earned a 1-0 win owing to a penalty from Kylian Mbappe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-vice-captain-india-asia-cup-t20i-squad-return-2773904-2025-08-20",
      "headline": "The Virat Kohli insurance: Why India picked Shubman Gill in Asia Cup squadSanju Samson and Abhishek Sharma symbolise India's new brand of T20 audacity, yet selectors have turned to Shubman Gill for balance. His return, signals not just a tactical switch but also the renewal of an insurance policy that Virat Kohli once provided to the T20I side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohamed-salah-morgan-rogers-pfa-player-of-the-year-awards-full-list-2773906-2025-08-20",
      "headline": "Mohamed Salah scripts history with third PFA Player of the Year awardLiverpool forward Mohamed Salah was named the Professional Footballers' Association (PFA) Player of the Year on Tuesday, becoming the first player in history to win the award three times. Aston Villa and England midfielder Morgan Rogers was also recognised, receiving the PFA Young Player of the Year award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-emma-raducanu-viral-shot-us-open-mixed-doubles-2773869-2025-08-20",
      "headline": "Watch: Alcaraz shocks Raducanu, internet with daring around-the-net shotDespite their defeat, Carlos Alcaraz and Emma Raducanu created one of the most memorable moments of the US Open mixed doubles.. The moment sparked widespread fan admiration and highlighted their unique on-court chemistry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-yashasvi-jaiswal-asia-cup-squad-selection-2773866-2025-08-20",
      "headline": "Asia Cup: Jaiswal's exclusion from Indian squad surprises Madan LalYoung India opener Yashasvi Jaiswal's exclusion from the Asia Cup squad has surprised former cricketer Madan Lal. Jaiswal was snubbed for Shubman Gill in India's 15-member squad, announced on Tuesday, August 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/alexander-isak-vs-newcastle-united-premier-league-transfer-standoff-explained-2773856-2025-08-20",
      "headline": "Alexander Isak vs Newcastle United: Premier League transfer stand-off explainedAlexander Isak's standoff with Newcastle United escalated dramatically on Tuesday night, as the Sweden striker publicly accused the club of breaking promises and betraying his trust. Newcastle said in a statement that no commitment was made by a club official that Isak could leave this summer.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}