{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/two-retirees-rs-2-crore-each-yet-one-runs-out-of-money-early-ca-explains-why-2773436-2025-08-19",
      "headline": "Two retirees, Rs 2 crore each, yet one runs out of money early. CA explains whyTwo retirees may have the same Rs 2 crore in savings, but their financial journeys can differ drastically. A CA explains how market timing and sequencing risk can decide who runs out of money first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-reform-overhaul-two-slab-structure-done-deal-or-not-2773431-2025-08-19",
      "headline": "Are next-gen GST reforms a done deal?The next-gen GST overhaul could redefine India's tax landscape, but consensus among states and revenue concerns will decide its fate. For now, GST 2.0 is a promise, not a done deal. Read to know why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-u-explained-check-eligibility-deadline-and-penalties-for-updated-returns-2773383-2025-08-19",
      "headline": "ITR-U explained: Check eligibility, deadline, and penalties for updated returnsThe Central Board of Direct Taxes (CBDT) has made it simpler for taxpayers to correct errors in their income tax returns through the updated ITR-U. Here's a guide on who can file, the deadline, and possible penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-you-should-wait-until-october-for-big-purchases-explains-expert-2773330-2025-08-19",
      "headline": "Why you should wait until October for big purchases, explains expertIf you've been planning to buy a car, air conditioner, or other expensive items, it might be wise to hold off for a few weeks. Expert says waiting until October could save you money thanks to upcoming GST reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lower-gst-better-than-income-tax-relief-for-your-wallet-savings-2773328-2025-08-19",
      "headline": "Why lower GST is better for your wallet than income tax reliefUnlike income tax, which applies only to those earning above a certain threshold, GST is an indirect tax levied on almost every transaction, covering nearly everything you buy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-semiconductor-complex-fire-1989-impact-and-indigenous-chip-production-plan-2773326-2025-08-19",
      "headline": "How the SCL fire in Mohali sabotaged India's chip dreamsThe blaze caused losses estimated at Rs 75 crore in 1989, but the true cost the nation would pay would be known decades later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-share-price-rising-today-explained-2773263-2025-08-19",
      "headline": "Explained: Why Ola Electric shares rose 7% in early tradeOla Electric's rising share price appears to be a result of renewed investor optimism, driven by the company's ambitious EV targets and gigafactory plans, but sustaining momentum will depend on market share recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-over-150-points-higher-nifty-above-24900-ril-jumps-nearly-2-2773238-2025-08-19",
      "headline": "Sensex, Nifty gain as GST reforms buzz keeps investor sentiment bullishAt 9:21 am, the S&P BSE Sensex climbed 150.78 points to 81,424.53, while the NSE Nifty50 gained 38.15 points to 24,915.10. Most broader market indices also traded in the green during early deals, indicating improved investor sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/next-generation-gst-reforms-will-reduce-tax-burden-boost-growth-chief-economic-advisor-2773229-2025-08-19",
      "headline": "Next-generation GST reforms will reduce tax burden, boost growth: CEAChief Economic Advisor Dr. V Anantha Nageshwaran said the GST overhaul, coupled with earlier tax cuts, will lower consumer costs, ease inflation, and boost disposable incomes, calling it a transformative step in India's eight-year tax reform journey"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/received-a-fake-income-tax-call-key-warning-signs-and-tips-to-protect-yourself-2772963-2025-08-18",
      "headline": "Received a fake income tax call? Key warning signs and tips to protect yourselfScammers are increasingly posing as income tax officials to trick people into sharing personal and financial information. If you receive a suspicious call during the filing season, it's important to stay calm and know the warning signs before taking any action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-job-unemployment-rate-drops-52-percent-july-festive-season-gst-cut-agriculture-economy-gdp-2772962-2025-08-18",
      "headline": "India's job market shows relief as unemployment rate falls to 5.2% in JulyThe jobless rate in rural areas for people aged 15 years and above fell to 4.4% in July from 4.9% in June. Seasonal demand for workers in agriculture and related activities supported this improvement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-bengaluru-new-office-rs-1000-crore-embassy-zenith-10-year-report-2772934-2025-08-18",
      "headline": "Apple rents 2.7 lakh sq ft in Bengaluru, costing Rs 1,000 crore over a decadeThe lease covers nine floors, from the 5th to the 13th floor, in the Embassy Zenith building. Apple has also made a security deposit of Rs 31.57 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-quicker-pf-access-here-are-the-updated-epfo-rules-2772871-2025-08-18",
      "headline": "Want quicker PF access? Here are the updated EPFO rulesUnder the updated rules, if your name, gender and date of birth match in both Aadhaar and UAN records, you no longer need EPFO approval to link the two."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-676-points-higher-nifty-above-24800-maruti-gains-9-percent-2772869-2025-08-18",
      "headline": "Sensex ends 676 points higher, Nifty above 24,800; Maruti gains 9%The S&P BSE Sensex gained 676.09 points to end at 81,273.75, while the NSE Nifty50 added 245.65 points to close at 24,876.95.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-tax-cut-festive-season-diwali-save-money-common-man-shopkeepers-cheaper-items-food-appliance-prices-2772865-2025-08-18",
      "headline": "GST bonanza before festive rush? Here's what it could mean for youThe biggest change for middle-class families could be in aspirational goods such as televisions, refrigerators, and washing machines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/crorepati-on-paper-cash-poor-in-reality-ca-explains-why-liquidity-matters-more-than-net-worth-2772767-2025-08-18",
      "headline": "Crorepati on paper, cash-poor in reality? CA explains why liquidity matters moreA high net worth can be misleading if most of your wealth is tied up in property or long-term investments. An expert believes that true financial security comes from having liquid assets that can be accessed at short notice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-cut-tax-slabs-low-reforms-rationalisation-insurance-everyday-item-cars-appliance-tv-money-2772777-2025-08-18",
      "headline": "GST cut before Diwali? These items likely to cost you less this festive seasonPrime Minister Narendra Modi gave the first indication of GST reforms in his Independence Day address from the Red Fort, calling it a \"Diwali Bonanza.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/sunjay-kapurs-sister-raises-concern-over-treatment-of-family-claims-being-sidelined-2772711-2025-08-18",
      "headline": "Exclusive: Sunjay Kapur's sister raises concern over treatment of familyMandhira Kapur Smith, sister of late Sona Comstar Chairperson Sunjay Kapur, has raised concerns over her family's treatment by the automotive firm founded by their late father. She said her 80-year-old mother Rani Kapur has been sidelined, claiming the family has been treated \"like strangers\" and excluded from obituaries and public acknowledgments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/big-gst-cuts-ahead-will-small-cars-insurance-get-cheaper-2772687-2025-08-18",
      "headline": "Big GST cuts ahead: Will small cars, insurance get cheaper?The proposal to reduce GST on insurance premiums could make health and life cover more affordable. Industry experts say this would be a welcome change and could help improve insurance penetration across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-6-excel-utility-now-live-who-is-eligible-to-file-2772650-2025-08-18",
      "headline": "ITR-6 excel utility now live: Who is eligible to file?The Income Tax Department has rolled out the excel utility for ITR-6 for AY 2025-26. But this form isn't meant for everyone — here's who is required to use it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/regaal-resources-ipo-allotment-out-today-status-online-guide-gmp-listing-gains-stock-market-debut-date-2772642-2025-08-18",
      "headline": "Regaal Resources IPO allotment today: Check status, GMP & listing dateInvestors who applied for the IPO can check their allotment status either through the BSE website or the registrar's platform, MUFG Intime India Private Limited (previously known as Link Intime India Pvt Ltd)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-up-1000-points-nifty-jump-stock-market-rally-auto-maruti-suzuki-mahindra-tata-motors-bajaj-gst-reform-diwali-2772619-2025-08-18",
      "headline": "Maruti Suzuki rallies 8%: Why GST relief is driving auto stocks higherEarly trade clearly showed strong buying in auto and financial stocks, while IT and pharma names dragged at the bottom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-sensex-jumps-1000-points-simpler-gst-regime-credit-rating-boost-2772615-2025-08-18",
      "headline": "Sensex jumps 1,000 points: Why is stock market rising today?At 9:24 am, the S&P BSE Sensex was up 950.18 points at 81,547.84, while the NSE Nifty50 jumped 310 points to 24,941.90. Broader market indices also gained as investors cheered the prospects of a simplified GST regime and an upgrade in India's sovereign credit rating by S&P."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-rallies-893-points-nifty-above-24900-maruti-suzuki-share-price-jumps-6-percent-2772611-2025-08-18",
      "headline": "Sensex, Nifty surge as PM hints at GST reforms by Diwali; Maruti jumps 7%The S&P BSE Sensex was up 1,062.91 points to 81,659.75, while the NSE Nifty50 jumped 356 points to 24,987.30 as of 9:32 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mandhira-kapur-family-excluded-sona-comstar-after-sunjay-kapur-death-2772541-2025-08-17",
      "headline": "Treated like strangers: Sunjay Kapur's sister alleges family sidelined by companyMandhira Kapur Smith alleged that the family has been treated as strangers and everyone's forgotten the legacy, forgotten that her mother's still alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/should-you-let-ai-analyse-your-online-spending-habits-ai-and-spending-habits-ai-for-budgeting-ai-personal-finance-tools-2772315-2025-08-17",
      "headline": "Should you let AI analyse your online spending habits?Artificial intelligence is gradually slipping into our wallets. From tracking what we buy to predicting our next expense, AI-based tools are becoming popular. But should you really let AI analyse your online spending habits?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/trade-deal-talks-hit-roadblock-as-us-delegations-india-visit-could-be-delayed-2772307-2025-08-17",
      "headline": "Trade deal talks hit roadblock as US delegation's India visit could be delayedThe India-US trade deal talks face a potential roadblock as the US delegation may delay its August 25 visit to India. This postponement impacts scheduled negotiations that were crucial for preventing additional tariffs. A 50% tariff on Indian goods is set to take effect from August 27. Currently, a 25% tariff is already in place, impacting exporters. The deferment of the meeting does not signify cancellation, but rather a delay. Reasons for the delay could be operational or related to geopolitical outcomes. \"A 50% tariff will be imposed on us from August 27 in totality.\" The BTA deal is anticipated by the end of September or October, with expectations for a meeting by the end of August, contingent on geopolitical developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-negotiators-visit-to-new-delhi-for-bilateral-trade-talks-deferred-to-be-rescheduled-report-2772226-2025-08-16",
      "headline": "Trade deal in limbo as US team's India visit deferred amid tariff warThe United States has been pressing India to open its agriculture and dairy sectors, but New Delhi has ruled out concessions, saying such moves would endanger small farmers and cattle rearers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-rate-cuts-rationalisation-simpler-tax-structure-good-simple-tax-cheaper-goods-2772146-2025-08-16",
      "headline": "Real wallet-friendly shake-up: GST 2.0 to feel like 'Good and Simple Tax'The government is set to launch GST 2.0 with major rate cuts, making essentials cheaper and simplifying tax slabs. The overhaul promises lower prices, fewer complications, and a true 'Good and Simple Tax'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/motor-car-insurance-best-tips-policy-comparison-add-ons-first-time-mistake-personal-finance-2771761-2025-08-16",
      "headline": "What nobody tells you about buying motor insuranceWhile car sales are climbing, many buyers remain unaware about the finer points of motor insurance, a gap that can cost them money and create problems when making a claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-proposes-two-gst-rates-of-5-and-18-tobacco-at-40-tax-cuts-for-farm-and-health-sectors-sources-2771789-2025-08-15",
      "headline": "Government proposes 5%, 18% GST slabs; tobacco at 40%, relief for farmers: SourcesThe government has proposed reducing GST to two slabs: 5% and 18% with sin goods at 40%, aiming to cut taxes on essentials like farm products, health items, handicrafts, and insurance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-rating-importance-what-do-they-mean-india-upgrade-pakistan-sp-global-2771729-2025-08-15",
      "headline": "Credit ratings decoded: How a simple upgrade can change a country's fortuneGlobal credit rating agency S&P Global has upgraded India's long-term unsolicited sovereign credit rating to 'BBB' from 'BBB-'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/gst-council-meeting-in-september-12-slam-may-be-dropped-sources-2771695-2025-08-15",
      "headline": "GST council meeting in September, 12% slam may be dropped: SourcesTwo-day GST Council meetings are expected in September to pave the way for reforms. The announcement was made by the Prime Minister from the ramparts of the Red Fort. These reforms are seen as a Diwali gift for the middle class. Key changes include the removal of the 12% GST slab and rate rationalisation for health and life insurance policies. The government aims to reduce the GST on most items currently in the 12% slab to 5%. This move is expected to make essential items such as footwear, bags, clothes, and toothpastes more affordable. The government is addressing concerns about inflation and the rising cost of living. Feedback regarding health insurance, which impacts the common person, has also been considered. The meetings in September are crucial for approving these changes, with implementation anticipated before Diwali. The Finance Ministry and state finance ministers have been involved in the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/removal-of-12-tax-slab-among-key-reforms-to-be-discussed-in-gst-council-meetings-in-september-sources-2771661-2025-08-15",
      "headline": "GST Council may drop 12% slab, more tax reforms in September meeting: SourcesThe meeting comes after Prime Minister Narendra Modi, in his Independence Day speech, announced plans for a major overhaul of the Goods and Services Tax (GST) system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/same-sex-couple-tax-law-biased-uneven-challenge-gits-received-partners-bombay-hc-report-2771623-2025-08-15",
      "headline": "Claiming bias, same-sex couple approaches court over uneven tax: ReportThe petition was admitted by a bench of Justice BP Colabawalla and Justice Firdoush Pooniwalla, which has also issued a notice to the Attorney General as the case raises a constitutional question."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/independence-day-pm-modi-announces-next-generation-gst-reform-with-significantly-lower-rates-2771561-2025-08-15",
      "headline": "PM Modi announces next-generation GST reform with significantly lower ratesDuring his Independence Day address, Prime Minister Narendra Modi announced a sweeping overhaul of the GST system, promising to unveil a \"next-generation\" tax regime with substantially lower rates this Diwali, which he hailed as a festive gift from the Centre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-speech-announces-rs-1-lakh-crore-pradhan-mantri-viksit-bharat-rojgar-yojana-scheme-2771555-2025-08-15",
      "headline": "Rs 15,000 from government on 1st private-sector job: PM's big youth schemePM Modi in his Independence Day speech said that the Pradhan Mantri Viksit Bharat Rojgar Yojana will create nearly 3.5 crore new employment opportunities for the youth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-cut-coming-soon-what-to-expect-after-pm-modi-big-diwali-promise-2771554-2025-08-15",
      "headline": "GST cut coming soon? What to expect after PM Modi's big Diwali promisePrime Minister Narendra Modi's announcement has set expectations for a substantial overhaul of the current multi-slab GST structure, which has been in place since 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-semiconductor-chips-2025-end-pm-modi-independence-day-speech-red-fort-gst-diwali-energy-nuclear-2771547-2025-08-15",
      "headline": "India to roll out its own semiconductor chips by end of 2025: PM ModiSpeaking on the country's 79th Independence Day, PM Modi hoisted the national flag for the 12th consecutive time before outlining the government's plans for technology, energy, and economic reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pms-double-diwali-promise-says-next-generation-gst-with-lower-taxes-coming-soon-2771537-2025-08-15",
      "headline": "PM's Double Diwali promise, says next-generation GST with much lower taxes soonPrime Minister Narendra Modi promised the roll-out a next-generation GST regime with substantially lower taxes before this Diwali, calling it a major festive gift to benefit individuals, MSMEs, and the economy."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-gulshan-devaiah-kulashekara-prequel-october-2025-rishab-shetty-2773454-2025-08-19",
      "headline": "Gulshan Devaiah makes Kannada debut with Rishab's Kantara Chapter 1, poster outBollywood actor Gulshan Devaiah will be making his Kannada debut with Rishab Shetty's 'Kantara Chapter 1'. The makers made the announcement by unveiling his character's poster on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/it-ends-with-us-isabela-ferrer-alleges-justin-baldoni-of-bullying-2773382-2025-08-19",
      "headline": "It Ends With Us actor Isabela Ferrer alleges Justin Baldoni of bullyingActor Isabela Ferrer is facing legal challenges amid Blake Lively and Justin Baldoni's feud. Ferrer played young Lily in Baldoni's directorial 'It Ends With Us'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bigg-boss-19-media-house-tour-salman-khan-show-hit-by-mumbai-rains-2773438-2025-08-19",
      "headline": "Bigg Boss 19: Media house tour of Salman Khan's show hit by Mumbai rainsSalman Khan hosted 'Bigg Boss 19' is set to premiere on August 24. Ahead of the grand evening, the media tour of the house has been stalled due to Mumbai rains. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/should-sholay-be-remade-jai-veeru-sherlock-holmes-investigates-ranbir-ranveer-allu-arjun-prabhas-vicky-kaushal-2773433-2025-08-19",
      "headline": "If Sholay was remade, who'd be Jai-Veeru: Sherlock Holmes investigatesA cult classic collides with a timeless sleuth. As Sholay marks half a century, Holmes and Watson debate who could possibly fill the boots of Jai and Veeru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rachita-ram-tamil-debut-coolie-rajinikanth-antagonist-kollywood-2773411-2025-08-19",
      "headline": "Who is Rachita Ram, the antagonist who stood out in Coolie's ensemble cast?Rachita Ram is a Kannada actor who made her feature film debut in 2013. She has featured in several hit films that involved some of the biggest names in the Kannada film industry, and recently made her Tamil debut in Rajinikanth's 'Coolie' as one of the antagonists, Kalyani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/zakir-khan-stand-up-comedy-performance-packed-madison-square-garden-feels-like-personal-success-opinion-2773446-2025-08-19",
      "headline": "Why Zakir Khan's stand-up at packed Madison Square Garden feels like personal successAt Madison Square Garden, Zakir Khan proved that dreams spoken in Hindi, with the accent of Indore and the honesty of a 'sakht launda', can be realised across the world. That standing ovation was a gratitude to Khan for being raw, real and unapologetically desi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-factory-worker-wins-rs-25-lakh-amitabh-bachchan-dream-of-taking-wife-on-manali-trip-2773405-2025-08-19",
      "headline": "KBC 17: Factory worker wins Rs 25 lakh, shares dream of taking wife on Manali tripIn the latest episode of 'Kaun Banega Crorepati 17', a factory worker won Rs 25 lakh. After winning the amount, he shared his dreams of taking his wife to Manali. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rubina-dilaik-update-stranded-himachal-pradesh-rains-landslides-2773331-2025-08-19",
      "headline": "We're safe: Rubina Dilaik updates fans after being stranded in Himachal rainsActor Rubina Dilaik expressed relief and gratitude after finding shelter in Himachal Pradesh amid heavy rain and landslides. The actor reassured fans on Instagram that she and her children are safe.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/prince-narula-condemns-firing-elvish-yadav-home-roadies-xx-gang-leader-2773357-2025-08-19",
      "headline": "Prince Narula condemns firing at Elvish Yadav's home, calls it unacceptableActor Prince Narula condemned the firing incident at Elvish Yadav's Gurugram home on Monday. He expressed concern for Yadav's family on Instagram and called it unacceptable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-defects-review-compact-yet-ambitious-original-k-drama-that-will-surprise-you-2773396-2025-08-19",
      "headline": "The Defects review: Compact yet ambitious original K-drama that will surprise youRelease Date:Mon Jul 21, 2025The Defects is a gripping K-drama that challenges societal values through a unique story of genetically engineered children fighting for survival. Available on Channel K in India, it blends thriller elements with deep moral questions in a near-future setting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kichcha-sudeep-buys-land-vishnuvardhan-darshan-centre-kengeri-2773344-2025-08-19",
      "headline": "Kichcha Sudeep buys land for Vishnuvardhan's new memorial in BengaluruKichcha Sudeep bought new land to build the Vishnuvardhan Darshan Centre as debates continue over the demolished memorial. President of the Vishnusena Committee Veerakaputra Srinivas made the announcement recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-kamal-haasan-gangsters-lokesh-kanagaraj-rkfi-2773384-2025-08-19",
      "headline": "Rajinikanth, Kamal Haasan reunite after 46 years as ageing gangsters: ReportsRajinikanth and Kamal Haasan are likely to join hands for director Lokesh Kanagaraj's next film. Reports are rife that this film will be a gangster drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-new-the-life-of-a-showgirl-vinyl-variants-sell-out-one-hour-2773342-2025-08-19",
      "headline": "Taylor Swift's new Showgirl vinyl variants sell out in less than an hourGlobal pop sensation Taylor Swift's new vinyl editions of The Life of a Showgirl sold out in under an hour, continuing her run of instant fan favourites."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mithun-chakraborty-superstar-rajinikanth-nelson-dilipkumar-jailer-2-2773340-2025-08-19",
      "headline": "Exclusive: Mithun Chakraborty to join Superstar Rajinikanth in Jailer 2Mithun Chakraborthy has been roped in to play a pivotal role in Superstar Rajinikanth's 'Jailer 2'. The film is being directed by Nelson Dilipkumar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/thama-teaser-ayushmann-khurrana-rashmika-mandanna-next-promises-dark-bloody-love-story-2773338-2025-08-19",
      "headline": "Thama teaser: Ayushmann, Rashmika's next promises a dark and bloody love storyThe teaser of Ayushmann Khurrana and Rashmika Mandanna's next 'Thama' is out. The film is set to release on Diwali 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-reflects-on-ageing-says-even-putting-on-trousers-is-challenging-2773315-2025-08-19",
      "headline": "Amitabh Bachchan reflects on ageing, says even putting on trousers is challengingAmitabh Bachchan shared his experiences with ageing, highlighting the new challenges in performing everyday tasks that once came effortlessly. The actor is 82 years old. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/food-poisoning-outbreak-dhurandhar-film-set-leh-crew-illness-2773319-2025-08-19",
      "headline": "Over 100 hospitalised due to food poisoning on Dhurandhar set in LehMore than 100 people fell ill due to food poisoning on the Dhurandhar film set in Leh. The incident raised concerns over food safety during large film productions and prompted an official investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vidya-balan-touches-rekha-feet-parineeta-event-2773314-2025-08-19",
      "headline": "Vidya Balan touches Rekha's feet at Parineeta event, wins hearts online. WatchBollywood actor Vidya Balan was present at the 'Parineeta' re-release event, which was also honoured by the presence of other celebrities such as Dia Mirza, Rekha, and Vidhu Vinod Chopra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lollapalooza-2026-india-dates-announced-tickets-open-august-26-2773275-2025-08-19",
      "headline": "Lollapalooza 2026 India dates announced, tickets open August 26Lollapalooza India is back in Mumbai for its fourth edition in January 2026. The festival promises nonstop music and exciting performances, drawing fans nationwide."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ex-supreme-court-judge-sudershan-reddy-likely-to-be-india-blocs-vice-presidential-candidate-sources-2773403-2025-08-19",
      "headline": "Ex-Supreme Court judge Sudershan Reddy is INDIA bloc Veep candidateAnnouncing the joint Opposition candidate, Congress chief Mallikarjun Kharge said the upcoming Vice Presidential election was an ideological battle. Expressing confidence about the upcoming elections, Reddy told India Today TV that, as the Opposition's candidate, he represented 60% of India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sudershan-reddy-india-bloc-vice-president-pick-andhra-not-tamil-nadu-opposition-throws-a-twist-in-veep-battle-2773441-2025-08-19",
      "headline": "With Sudershan Reddy, INDIA bloc's googly in vice-presidential contest with NDASources said the decision to field a candidate of \"great credibility outside the political sphere\" was intended to make it harder for regional parties to oppose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/rjd-leader-tejashwi-yadav-says-will-work-to-make-rahul-gandhi-prime-minister-during-next-lok-sabha-polls-2773391-2025-08-19",
      "headline": "Rahul Gandhi to be Opposition's PM pick? Tejashwi Yadav's remark sparks buzzTejashwi Yadav's remarks indicate that Rahul Gandhi would be the face of the INDIA bloc in the 2029 polls. The leadership conundrum has been a prickly issue for the INDIA bloc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-china-ties-ajit-doval-beijing-visit-ladakh-standoff-wang-yi-xi-jinping-modi-2773380-2025-08-19",
      "headline": "Setbacks of last few years not in our interest: Wang Yi at meeting with Ajit DovalSpeaking in New Delhi during the 24th round of Special Representative Level Talks on the boundary question, he noted that the October 2024 meeting between President Xi Jinping and Prime Minister Narendra Modi in Kazan had provided direction for the development of bilateral relations and given fresh impetus to efforts at resolving boundary issues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-heavy-rains-waterlogging-imd-red-alert-bmc-school-offices-holiday-work-from-home-2773291-2025-08-19",
      "headline": "Relentless rain cripples Mumbai; roads submerged, over 370 flights delayed  Live UpdatesAccording to Flightradar, 234 outbound and 141 inbound flights at Mumbai Airport were delayed, while Central Railway trains ran 20-30 minutes late."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-reform-overhaul-two-slab-structure-done-deal-or-not-2773431-2025-08-19",
      "headline": "Are next-gen GST reforms a done deal?The next-gen GST overhaul could redefine India's tax landscape, but consensus among states and revenue concerns will decide its fate. For now, GST 2.0 is a promise, not a done deal. Read to know why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/heavy-rain-thunderstorm-in-parts-of-delhi-ncr-orange-alert-issued-for-next-two-hours-2773470-2025-08-19",
      "headline": "Heavy rain, thunderstorm in parts of Delhi-NCR; Orange alert issuedThe weather department has issued an orange alert for the national capital, forecasting heavy rain and strong winds for the next two hours."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bjd-mp-sulata-deo-rape-death-threat-mahindra-group-employee-facebook-2773385-2025-08-19",
      "headline": "Mahindra employee threatens BJD MP with rape on Facebook, firm orders probeThe BJD MP shared screenshots of the threats issued by the Mahindra Group employee in a post on X, tagging Prime Minister Narendra Modi and Amit Shah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengal-files-trailer-vivek-agnihotri-film-gopal-patha-mukherjee-direct-action-day-1946-calcutta-killing-muslim-league-2773402-2025-08-19",
      "headline": "Who is Gopal Patha of Bengal Files? A Hindu hero or hoodlumGopal Mukherjee's grandson has filed an FIR over his portrayal in Vivek Agnihotri's The Bengal Files. Agnihotri says the film portrays Mukherjee as a hero. History has been divided over Gopal Patha, who organised Hindu resistance against Muslim mobs who went on the rampage during the Direct Action Day of 1946 in what is known as the Great Calcutta Killing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/super-301-and-us-tariff-india-china-trade-sanctions-japan-history-of-sudden-explained-trade-act-1974-trump-2773107-2025-08-19",
      "headline": "The ghost of Super 301: Why US trade wrath always finds IndiaWhat started as President Trump's trade campaign against China seems now to be focused on India. This has a strange echo from 35 years ago, when the US started out to target Japan, its economic rival, with the Super 301 but ended up with India in its crosshairs. This is how the governments of Rajiv Gandhi and VP Singh reacted then."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/indigo-passenger-says-co-pilot-barged-into-toilet-when-she-was-inside-airline-reacts-2773475-2025-08-19",
      "headline": "IndiGo passenger says co-pilot barged into toilet when she was inside, airline reactsA late-night flight turned into a nightmare for a Mumbai-based entrepreneur when an IndiGo co-pilot barged into the lavatory while she was inside. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-delhis-stray-dogs-belong-to-its-lanes-2772926-2025-08-18",
      "headline": "Why Delhi's stray dogs belong to its lanesMass relocation of strays risks overcrowding, disease and eroded emotional bonds. The way forward is humane solutions grounded in sterilisation and community care"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/zakir-khan-stand-up-comedy-performance-packed-madison-square-garden-feels-like-personal-success-opinion-2773446-2025-08-19",
      "headline": "Why Zakir Khan's stand-up at packed Madison Square Garden feels like personal successAt Madison Square Garden, Zakir Khan proved that dreams spoken in Hindi, with the accent of Indore and the honesty of a 'sakht launda', can be realised across the world. That standing ovation was a gratitude to Khan for being raw, real and unapologetically desi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/who-is-b-sudershan-reddy-india-blocs-vice-president-candidate-2773444-2025-08-19",
      "headline": "Who is B Sudershan Reddy, INDIA bloc's Vice President candidate?Former Supreme Court judge Sudershan Reddy has had a legal career spanning five decades. Here is everything you need to know about him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trumps-sellout-of-ukraine-lessons-for-india-china-and-the-world-2773271-2025-08-19",
      "headline": "Trump's sellout of Ukraine: Lessons for India, China and the WorldDonald Trump's Ukraine strategy marks a dangerous shift in US leadership, undermining global credibility, emboldening aggressors, and unsettling allies from Europe to India.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/terrifying-video-shows-car-crashing-into-influencers-mid-food-review-at-us-eatery-2773283-2025-08-19",
      "headline": "Video shows car crashing into food influencers mid-review at US restaurantHouston-based influencers Nina Santiago and fellow content creator Patrick Blackwood were in the middle of filming a food review when an SUV plowed through the front wall of the restaurant where they were seated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/should-sholay-be-remade-jai-veeru-sherlock-holmes-investigates-ranbir-ranveer-allu-arjun-prabhas-vicky-kaushal-2773433-2025-08-19",
      "headline": "If Sholay was remade, who'd be Jai-Veeru: Sherlock Holmes investigatesA cult classic collides with a timeless sleuth. As Sholay marks half a century, Holmes and Watson debate who could possibly fill the boots of Jai and Veeru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/railways-to-go-the-airport-way-regulates-baggage-weight-and-size-key-details-baggage-rules-in-railways-railways-baggage-rules-railways-new-baggage-rules-what-can-i-carry-in-railway-baggage-what-to-2773346-2025-08-19",
      "headline": "Railways to go the airport way with baggage weight regulations. Details hereNew rules are to be strictly implemented at key stations including Prayagraj, Kanpur, Mirzapur, and Aligarh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/fake-doctor-mbbs-uttar-pradesh-hospital-basti-busted-treatment-medicines-2773334-2025-08-19",
      "headline": "'Munna Bhai MBBS' in UP: Fake doctor caught treating patients in hospitalThe incident came to light after a man brought his wife to the hospital in a critical condition. The family alleged that she was left untreated for nearly two hours and later died. During this time, the fake doctor was found moving around in the emergency ward posing as medical staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-narendra-modis-expressway-push-is-redrawing-indias-urban-map-2772929-2025-08-18",
      "headline": "How Narendra Modi's expressway push is redrawing India's urban map\"Development our fate... one milestone at a time,\" said PM Modi while inaugurating the Dwarka Expressway and the Urban Extension Road-II in Delhi"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rachita-ram-tamil-debut-coolie-rajinikanth-antagonist-kollywood-2773411-2025-08-19",
      "headline": "Who is Rachita Ram, the antagonist who stood out in Coolie's ensemble cast?Rachita Ram is a Kannada actor who made her feature film debut in 2013. She has featured in several hit films that involved some of the biggest names in the Kannada film industry, and recently made her Tamil debut in Rajinikanth's 'Coolie' as one of the antagonists, Kalyani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-ties-trump-trade-deal-tariffs-damage-already-done-fareed-zakaria-2773324-2025-08-19",
      "headline": "Damage already done: Fareed Zakaria on downturn in India-US ties under TrumpGeopolitical expert Fareed Zakaria emphasised that imposing the highest tariffs on India while deepening its ties with Pakistan was the 'biggest foreign policy mistake' by Trump 2.0."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sudershan-reddy-opposition-vice-president-candidate-supreme-court-judge-nda-2773418-2025-08-19",
      "headline": "I appeal to all parties to support me, says INDIA bloc's Veep pick Sudershan ReddyMoments after the INDIA bloc announced him as its candidate for the Vice-Presidential election, B Sudershan Reddy appealed to all political parties, including those in the NDA, to support his nomination. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/your-brains-not-working-alone-your-bodys-been-in-on-it-the-whole-time-2773194-2025-08-19",
      "headline": "Your brain's not working alone - your body's been in on it the whole timeTurns out, thinking isn't just in your head. Literally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-gulshan-devaiah-kulashekara-prequel-october-2025-rishab-shetty-2773454-2025-08-19",
      "headline": "Gulshan Devaiah makes Kannada debut with Rishab's Kantara Chapter 1, poster outBollywood actor Gulshan Devaiah will be making his Kannada debut with Rishab Shetty's 'Kantara Chapter 1'. The makers made the announcement by unveiling his character's poster on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/it-ends-with-us-isabela-ferrer-alleges-justin-baldoni-of-bullying-2773382-2025-08-19",
      "headline": "It Ends With Us actor Isabela Ferrer alleges Justin Baldoni of bullyingActor Isabela Ferrer is facing legal challenges amid Blake Lively and Justin Baldoni's feud. Ferrer played young Lily in Baldoni's directorial 'It Ends With Us'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/should-sholay-be-remade-jai-veeru-sherlock-holmes-investigates-ranbir-ranveer-allu-arjun-prabhas-vicky-kaushal-2773433-2025-08-19",
      "headline": "If Sholay was remade, who'd be Jai-Veeru: Sherlock Holmes investigatesA cult classic collides with a timeless sleuth. As Sholay marks half a century, Holmes and Watson debate who could possibly fill the boots of Jai and Veeru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rachita-ram-tamil-debut-coolie-rajinikanth-antagonist-kollywood-2773411-2025-08-19",
      "headline": "Who is Rachita Ram, the antagonist who stood out in Coolie's ensemble cast?Rachita Ram is a Kannada actor who made her feature film debut in 2013. She has featured in several hit films that involved some of the biggest names in the Kannada film industry, and recently made her Tamil debut in Rajinikanth's 'Coolie' as one of the antagonists, Kalyani. "
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manu-bhaker-bronze-10m-air-pistol-asian-shooting-championship-2773482-2025-08-19",
      "headline": "Manu Bhaker continues consistent run, wins 10m bronze in Asian ChampionshipsManu Bhaker secured a bronze medal in the women's 10m air rifle event at the Asian Shooting Championship. Her consistent performance highlights India's growing strength in continental shooting competitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dewald-brevis-aus-vs-sa-1st-odi-travis-head-2773462-2025-08-19",
      "headline": "Dewald Brevis' promising ODI debut ends in two balls against Travis HeadAUS vs SA: Dewald Brevis lit up his ODI debut with a first-ball six against Australia in Cairns, but his fireworks ended just two deliveries later as Alex Carey caught him at long-on. The cameo echoed Johann Louw's unique 2008 feat of starting his ODI batting career with a six."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-century-maharashtra-debut-buchi-babu-invitational-2773449-2025-08-19",
      "headline": "After quitting Mumbai, Prithvi Shaw smashes century in maiden knock for MaharashtraBuchi Babu Invitational 2025: Prithvi Shaw made a strong impact with a century in his first competitive match for Maharashtra. The 25-year-old hit a composed hundred on a challenging pitch against Chattisgarh in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-2027-odi-world-cup-ambati-rayudu-2773415-2025-08-19",
      "headline": "Rohit Sharma should continue as India's ODI captain till 2027 World Cup: RayuduAmbati Rayudu supports Rohit Sharma continuing as India's ODI captain ahead of the 2027 World Cup. He emphasises Rohit's leadership and fitness as key to India's success and stresses Virat Kohli's vital role at number three."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-contracts-babar-rizwan-shaheen-2773375-2025-08-19",
      "headline": "Pakistan annual contracts: Babar, Rizwan demoted, no players in Category AThe Pakistan Cricket Board has reshuffled its central contracts for 2025-26. They have taken the big decision of demoting star players Babar Azam and Mohammad Rizwan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-iga-swiatek-cincinnati-open-us-open-video-2773358-2025-08-19",
      "headline": "Watch: Alcaraz, Swiatek fly together to US Open after Cincinnati Open winCarlos Alcaraz and Iga Swiatek, fresh from their Cincinnati Open triumphs, boarded a private jet together to New York for the US Open. Alcaraz teams up with Emma Raducanu, while Swiatek partners Casper Ruud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-record-inter-miami-mls-barcelona-2773354-2025-08-19",
      "headline": "Barca, Argentina and now Miami: Messi's record-breaking spree continuesLionel Messi has become the leading goal scorer and assist provider in Inter Miami history. With a goal and an assist against LA Galaxy, Messi etched his name in football history with a unique record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sinquefield-cup-praggnanandhaa-climbs-world-no-3-spot-beating-d-gukesh-2773335-2025-08-19",
      "headline": "Praggnanandhaa climbs to World No. 3 after beating Gukesh at Sinquefield CupIndian Grandmaster R Praggnanandhaa has risen to a career-best world No. 3 in the live FIDE ratings following a stunning victory over world champion D Gukesh in the opening round of the Sinquefield Cup 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-odi-world-cup-india-squad-updates-harmanpreet-kaur-smriti-mandhana-2773298-2025-08-19",
      "headline": "Women's World Cup squad announcement LIVE: Smriti, Harman reach BCCI headquarterWomen's ODI World Cup 2025 Live Updates: Chief selector Neetu David will name the squad later on Tuesday for the World Cup and the ODI series against Australia. The focus will be on whether Shafali Verma and Renuka Singh get picked in the squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kagiso-rabada-injury-ruled-out-south-africa-australia-odi-series-2773280-2025-08-19",
      "headline": "South Africa pacer Kagiso Rabada ruled out of Australia ODIsSouth Africa will be without fast bowler Kagiso Rabada for the One-Day International (ODI) series against Australia, which begins on 19 August. The 30-year-old pacer has been ruled out due to inflammation in his right ankle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-squad-rinku-singh-form-dip-2773254-2025-08-19",
      "headline": "Asia Cup: Is Rinku Singh no more India's trusted T20I finisher?Rinku Singh, once hailed as India's next big T20 finisher, has seen his form dip sharply over the past year. Struggling both internationally and in the IPL, the once fearless stroke-maker now faces uncertainty over his place in India's Asia Cup squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-record-inter-miami-mls-barcelona-2773354-2025-08-19",
      "headline": "Barca, Argentina and now Miami: Messi's record-breaking spree continuesLionel Messi has become the leading goal scorer and assist provider in Inter Miami history. With a goal and an assist against LA Galaxy, Messi etched his name in football history with a unique record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sinquefield-cup-praggnanandhaa-climbs-world-no-3-spot-beating-d-gukesh-2773335-2025-08-19",
      "headline": "Praggnanandhaa climbs to World No. 3 after beating Gukesh at Sinquefield CupIndian Grandmaster R Praggnanandhaa has risen to a career-best world No. 3 in the live FIDE ratings following a stunning victory over world champion D Gukesh in the opening round of the Sinquefield Cup 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-odi-world-cup-india-squad-updates-harmanpreet-kaur-smriti-mandhana-2773298-2025-08-19",
      "headline": "Women's World Cup squad announcement LIVE: Smriti, Harman reach BCCI headquarterWomen's ODI World Cup 2025 Live Updates: Chief selector Neetu David will name the squad later on Tuesday for the World Cup and the ODI series against Australia. The focus will be on whether Shafali Verma and Renuka Singh get picked in the squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kagiso-rabada-injury-ruled-out-south-africa-australia-odi-series-2773280-2025-08-19",
      "headline": "South Africa pacer Kagiso Rabada ruled out of Australia ODIsSouth Africa will be without fast bowler Kagiso Rabada for the One-Day International (ODI) series against Australia, which begins on 19 August. The 30-year-old pacer has been ruled out due to inflammation in his right ankle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-squad-rinku-singh-form-dip-2773254-2025-08-19",
      "headline": "Asia Cup: Is Rinku Singh no more India's trusted T20I finisher?Rinku Singh, once hailed as India's next big T20 finisher, has seen his form dip sharply over the past year. Struggling both internationally and in the IPL, the once fearless stroke-maker now faces uncertainty over his place in India's Asia Cup squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/navdeep-saini-on-rcb-virat-kohli-gautam-gambhir-exclusive-2773156-2025-08-19",
      "headline": "Navdeep Saini targets IPL return, silences Gautam Gambhir's criticsHaving last played for India in 2021, Navdeep Saini remains determined to make a comeback to the national side. The fire still burns bright in his eyes, and his immediate goal is to earn a place in the Royal Challengers Bangalore squad for IPL 2026. To that end, the fast bowler is putting in the hard yards, aiming to impress with a stellar performance for the East Delhi Riders in the Delhi Premier League 2025 (DPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-reaction-cincinnati-open-title-sinner-retires-illness-2773228-2025-08-19",
      "headline": "Carlos Alcaraz shows class after Cincinnati win, wishes Sinner a speedy recoveryAfter winning his first Cincinnati title, Carlos Alcaraz wished Jannik Sinner—who retired on Monday due to illness—a speedy recovery ahead of the US Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-mixed-doubles-format-live-stream-criticism-explained-2773211-2025-08-19",
      "headline": "Explained: What's the buzz about US Open mixed doubles tournamentThe 2025 US Open Mixed Doubles will debut a two-day fast-track format with 16 teams and record 1 million US dollars prize money for the winners. The changes, however, have sparked backlash from doubles specialists who say the format disrespects tradition and reduces the event to an exhibition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-asia-cup-2025-india-squad-selection-ipl-2773210-2025-08-19",
      "headline": "Dark horse no more: Why Shreyas Iyer deserves a fair look for Asia Cup selectionShreyas Iyer's exceptional IPL 2025 form, middle-over dominance against spin, and composure under pressure make a strong case for his inclusion in India's Asia Cup squad in the UAE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-squad-live-updates-shubman-agarkar-shubman-gill-2773205-2025-08-19",
      "headline": "Asia Cup 2025 squad Live: Selection meeting begins in MumbaiIndia Asia Cup 2025 squad announcement Live Updates: The press conference to announce Indian men's team squad for the continental tournament has been delayed till 2 PM. Rain forces a late change in schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-defeats-jasmine-paolini-to-win-her-first-cincinnati-open-title-2773203-2025-08-19",
      "headline": "Iga Swiatek defeats Jasmine Paolini to win her first Cincinnati Open titleIga Swiatek secured her third title of 2025 by winning the Cincinnati Open final against Jasmine Paolini. The victory boosts Swiatek's confidence as she prepares for the upcoming US Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-cincinnati-open-title-jannik-sinner-retires-2773172-2025-08-19",
      "headline": "Carlos Alcaraz wins maiden title after hapless Jannik Sinner retiresCarlos Alcaraz won his first Cincinnati Open title after Jannik Sinner retired midway through the final with illness. Sinner's withdrawal raises doubts about his readiness for the US Open, while Alcaraz prepares to compete in mixed doubles with Emma Raducanu.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-asia-cup-2025-india-squad-selection-ipl-2773210-2025-08-19",
      "headline": "Dark horse no more: Why Shreyas Iyer deserves a fair look for Asia Cup selectionShreyas Iyer's exceptional IPL 2025 form, middle-over dominance against spin, and composure under pressure make a strong case for his inclusion in India's Asia Cup squad in the UAE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-squad-live-updates-shubman-agarkar-shubman-gill-2773205-2025-08-19",
      "headline": "Asia Cup 2025 squad Live: Selection meeting begins in MumbaiIndia Asia Cup 2025 squad announcement Live Updates: The press conference to announce Indian men's team squad for the continental tournament has been delayed till 2 PM. Rain forces a late change in schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-defeats-jasmine-paolini-to-win-her-first-cincinnati-open-title-2773203-2025-08-19",
      "headline": "Iga Swiatek defeats Jasmine Paolini to win her first Cincinnati Open titleIga Swiatek secured her third title of 2025 by winning the Cincinnati Open final against Jasmine Paolini. The victory boosts Swiatek's confidence as she prepares for the upcoming US Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-cincinnati-open-title-jannik-sinner-retires-2773172-2025-08-19",
      "headline": "Carlos Alcaraz wins maiden title after hapless Jannik Sinner retiresCarlos Alcaraz won his first Cincinnati Open title after Jannik Sinner retired midway through the final with illness. Sinner's withdrawal raises doubts about his readiness for the US Open, while Alcaraz prepares to compete in mixed doubles with Emma Raducanu.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-indian-super-league-supreme-court-u-turn-clarification-fsdl-2773133-2025-08-18",
      "headline": "AIFF clarifies ISL U-turn, cites legal advice for Supreme Court stepThe All India Football Federation defended its sudden U-turn on the ISL case, citing legal advice to prioritise the National Sports Governance Bill, after a weekend of confusion over its Supreme Court approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/gianluigi-donnarumma-ederson-transfer-news-manchester-city-galatasaray-explained-2773126-2025-08-18",
      "headline": "Gianluigi Donnarumma-Ederson transfer domino at Manchester City: ExplainedAugust's transfer window could see one of the most dramatic goalkeeping reshuffles in recent years, with Ederson, Donnarumma, Manchester City, PSG, and Galatasaray locked in a chain reaction of uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-supreme-court-fsdl-aiff-clubs-hearing-plea-2773096-2025-08-18",
      "headline": "Supreme Court steps in: ISL clubs, AIFF and FSDL face decisive showdownThe Supreme Court will hear the AIFF–FSDL contract dispute on August 22, a date that could determine the fate of the Indian Super League and decide the immediate future of 11 clubs in limbo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-varun-chakravarthy-on-gautam-gambhir-2773079-2025-08-18",
      "headline": "Gautam Gambhir always backed me when others ignored: Varun ChakravarthyIndia wrist spinner Varun Chakravarthy has revealed how Gautam Gambhir backed him during the lowest phase of his career when he was ignored by others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-kedar-jadhav-boycott-2773035-2025-08-18",
      "headline": "Confident India won't play Pakistan in Asia Cup 2025: Kedar JadhavFormer India cricketer Kedar Jadhav has called for a boycott of the Asia Cup 2025 match against Pakistan. India and Pakistan are scheduled to play in Dubai on September 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-on-shubman-gill-in-t20is-asia-cup-2025-2773030-2025-08-18",
      "headline": "Shubman Gill can adapt to any format, T20 not just about big hitting: HarbhajanFormer India spinner Harbhajan Singh has backed Shubman Gill to adapt his game to T20Is, mentioning his ability to switch gears quickly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-injury-miss-duleep-trophy-2025-east-zone-squad-2772952-2025-08-18",
      "headline": "Why Ishan Kishan will miss Duleep Trophy for East Zone? Injury details revealedThe reason behind Ishan Kishan missing the Duleep Trophy has been revealed, with the wicketkeeper still recovering from an injury he suffered recently. Kishan was replaced in the squad by Odisha's Aashirwad Swain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chetan-sharma-defends-jasprit-bumrahs-workload-management-2772944-2025-08-18",
      "headline": "Jasprit Bumrah should listen to physios, they're the better judges: Chetan SharmaFormer India fast bowler Chetan Sharma has defended Jasprit Bumrah's workload management, saying that the players should listen to their physios."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-century-buchi-babu-tournament-mumbai-cricket-test-comeback-2024-2772930-2025-08-18",
      "headline": "Sarfaraz Khan slams 138 off 114 in Chennai, sends strong message to selectorsSarfaraz Khan scored a quickfire 138 in the Buchi Babu Invitational tournament in Chennai. The 27-year-old batter will be bidding to return to the Test squad when India's home season begins in October. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-denies-player-release-for-india-camp-injury-fifa-rules-controversy-2772922-2025-08-18",
      "headline": "Mohun Bagan refuses to release players for India camp citing injury concernsMohun Bagan firmly refused to release their players for the ongoing national camp, stating that it is \"not mandatory\" outside a FIFA window and accusing the All India Football Federation of neglecting player welfare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-jaker-ali-anik-press-conference-2772913-2025-08-18",
      "headline": "Bangladesh are going to Asia Cup to become champions: Jaker Ali AnikBangladesh batter Jaker Ali Anik said the team will approach the Asia Cup 2025 with the goal of winning their first title, backed by recent T20I series wins over Sri Lanka and Pakistan. He added that the Tigers won't take any opponent lightly and will stick to their own brand of cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/india-doping-cases-woman-triple-jumper-suspended-nada-2772879-2025-08-18",
      "headline": "Indian woman triple jumper suspended by NADA on doping chargesA Indian woman triple jumper has been suspended by NADA after testing positive for a banned substance. The growing doping cases in Indian athletics raise serious concerns over sports integrity and future compliance."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}